OpenDTEF-v1912/tutorials/incompressible/overSimpleFoam/aeroFoil/background_overset/system/postProcessingDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      postProcessingDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{
    processorField1
    {
        // Type of functionObject
        type            processorField;

        // Where to load it from (if not already in solver)
        libs            (fieldFunctionObjects);

        // Function object enabled flag
        enabled         true;

        // When to output the average fields
        writeControl    writeTime;
    }
}

// ************************************************************************* //
